authz_benchmark/jmeter_report/k8s_1ng_1j_3r_19200t_600e_4cpu_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 19200 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 904.97s, 2740.49 req/s, 20.61MB/s
requests: 2466438 total, 2485638 started, 2466438 done, 2466438 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2466438 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.11GB (19445883732) total, 239.92MB (251576676) headers (space savings 32.00%), 17.79GB (19100095872) data
                     min         max         mean         sd        +/- sd
time for request:   168.37ms      13.52s       6.90s    506.16ms    94.08%
time for connect:      1.04s      11.40s       6.38s       2.83s    66.22%
time to 1st byte:      8.03s      22.82s      13.45s       3.74s    63.50%
req/s           :       0.14        0.15        0.14        0.00    75.34%